docs/posts/2015-01-13-the-fourth-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>the Fourth Sunday after Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">the Fourth Sunday after Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
Holy God,
</p>

<p>
For those times<br>
when we hear<br>
the ridicule,<br>
the jeers,<br>
the insults,<br>
and see the looks<br>
of pain and loneliness,<br>
yet stand in uncomfortable silence,<br>
and do nothing,
</p>

<p>
Lord have mercy.
</p>

<p>
And for those times<br>
when we strike back<br>
at those who hurt us,<br>
and start another<br>
cycle of violence<br>
that has no end in sight,
</p>

<p>
Christ have mercy.
</p>

<p>
The powerful rested<br>
easy on their thrones,<br>
when the things of God<br>
were bought and sold<br>
on the marketplace;<br>
for the temple<br>
was their palace,<br>
and its religion<br>
was their power.
</p>

<p>
Lord Jesus,<br>
storm into our lives<br>
as you did the temple;<br>
may the chains be broken,<br>
the tables turned,<br>
and our hearts set free.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org9576d6f">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
